package programmers.lv2;

import java.util.Stack;

public class 괄호_회전하기 {

	public static void main(String[] args) {

		// 강의 중에 알고리즘에 관한 내용이 있었으나,
		// 이런 알고리즘을 사용하는 비슷한 문제가 많이 있는걸로 볼때 꽤 중요하다고 판단됨.
		// 그래서 강사님 코드는 보지 않고 알고리즘 설명 들었던 내용만 상기하며
		// 구현에 집중해서 공부하기로 결정.


		//-------------------------------------

		// 가장먼저 제한사항부터 확인
		// 's의 길이는 1 이상 1,000 이하입니다.'
		// 제한사항이 한줄인것으로 보아 s가 시한복잡도에 영향을 주는 변수인 것으로 판단.
		// 강사님의 시간복잡도 기준표를 참고해서 O(N^2)의 시간복잡도 이하로 풀어야 한다.
		// 즉, 2중 for문까지는 쓸 수 있다.

		//-------------------------------------

		// 문제 확인 후
		// 올바른 괄호 판단 알고리즘이 O(N)
		// 괄호 회전 알고리즘이 O(N)
		// 해서 O(N^2)이 될 것이라 생각

		//-------------------------------------

		// 알고리즘 구현
		// 


		Stack<Character> st = new Stack<>();







	}

}
